### Terraform `plan` Succeeded for Workspace: `dev`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.waf.aws_wafv2_web_acl.default will be created
+   resource "aws_wafv2_web_acl" "default" {
+       arn         = (known after apply)
+       capacity    = (known after apply)
+       description = "WAF acl for Cloudfront"
+       id          = (known after apply)
+       lock_token  = (known after apply)
+       name        = "default"
+       scope       = "CLOUDFRONT"
+       tags        = {
+           "Name" = "default"
        }
+       tags_all    = {
+           "Name" = "default"
        }

+       default_action {
+           allow {
            }
        }

+       rule {
+           name     = "BodySizeLimitForNormalPagesRule"
+           priority = 8

+           action {

+               block {
                }
            }

+           statement {
+               and_statement {
+                   statement {

+                       label_match_statement {
+                           key   = "awswaf:managed:aws:core-rule-set:SizeRestrictions_Body"
+                           scope = "LABEL"
                        }
                    }
+                   statement {

+                       not_statement {
+                           statement {

+                               byte_match_statement {
+                                   positional_constraint = "CONTAINS"
+                                   search_string         = "uploader"

+                                   field_to_match {

+                                       uri_path {}
                                    }

+                                   text_transformation {
+                                       priority = 0
+                                       type     = "NONE"
                                    }
                                }
                            }
                        }
                    }
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "BodySizeLimitForNormalPagesRule"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "BodySizeLimitForUploaderPageRule"
+           priority = 9

+           action {

+               block {
                }
            }

+           statement {

+               size_constraint_statement {
+                   comparison_operator = "GE"
+                   size                = 10000000

+                   field_to_match {

+                       body {}
                    }

+                   text_transformation {
+                       priority = 0
+                       type     = "NONE"
                    }
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "BodySizeLimitForUploaderPageRule"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "RateLimitRule"
+           priority = 7

+           action {

+               block {
                }
            }

+           statement {

+               rate_based_statement {
+                   aggregate_key_type = "IP"
+                   limit              = 10000
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "RateLimitRule"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "AWSManagedRulesAmazonIpReputationList"
+           priority = 3

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesAmazonIpReputationList"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AWSManagedRulesAmazonIpReputationList"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "AWSManagedRulesAnonymousIpList"
+           priority = 4

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesAnonymousIpList"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AWSManagedRulesAnonymousIpList"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "AWSManagedRulesCommonRuleSet"
+           priority = 0

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesCommonRuleSet"
+                   vendor_name = "AWS"

+                   excluded_rule {
+                       name = "SizeRestrictions_BODY"
                    }
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AWSManagedRulesCommonRuleSet"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "AWSManagedRulesKnownBadInputsRuleSet"
+           priority = 2

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesKnownBadInputsRuleSet"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "AWSManagedRulesLinuxRuleSet"
+           priority = 6

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesLinuxRuleSet"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AWSManagedRulesLinuxRuleSet"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "AWSManagedRulesSQLiRuleSet"
+           priority = 1

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesSQLiRuleSet"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AWSManagedRulesSQLiRuleSet"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "AWSManagedRulesUnixRuleSet"
+           priority = 5

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesUnixRuleSet"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AWSManagedRulesUnixRuleSet"
+               sampled_requests_enabled   = true
            }
        }

+       visibility_config {
+           cloudwatch_metrics_enabled = false
+           metric_name                = "aws_wafv2_web_acl_default"
+           sampled_requests_enabled   = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>